tap "oven-sh/bun"
tap "tw93/tap"
brew "aom" # AV1 video codec library
brew "aria2" # download utility
brew "awk" # GNU awk
brew "bash" # GNU Bash shell
brew "bat" # cat clone with syntax highlighting and Git integration
brew "boxes"
brew "brush"
brew "bun"
brew "caddy" # powerful, enterprise-ready, open source web server with automatic HTTPS
brew "chezmoi" # manage your dotfiles across multiple machines
brew "cmake"
brew "csvtk"
brew "czg"
brew "dotnet"
brew "duckdb" # in-process SQL OLAP database management system
brew "dust" # more intuitive version of 'du'
brew "eza" # modern replacement for 'ls'
brew "fd" # simple, fast and user-friendly alternative to 'find'
brew "ffmpeg"
brew "fontconfig"
brew "fortune"
brew "fzf" # command-line fuzzy finder
brew "gawk" # GNU awk
brew "gcc"
brew "gh" # GitHub CLI
brew "git-delta" # improved git diff viewer
brew "git"
brew "gnupg" # GPG for signing commits
brew "go"
brew "gobject-introspection"
brew "graphviz" # graph visualization software
brew "harper"
brew "hexyl" # hex viewer
brew "htop" # interactive process viewer
brew "jpeg-xl" # JPEG XL image codec
brew "jq" # command-line JSON processor
brew "lazygit" # terminal UI for git
brew "lftp" # sophisticated file transfer program
brew "libmagic" # file type identification library
brew "lima" # Linux virtual machines on macOS
brew "litecli" # SQLite CLI with autocompletion and syntax highlighting
brew "navi" # interactive cheatsheet tool
brew "nginx"
brew "ninja" # build system
brew "nmap" # network scanner
brew "node"
brew "nq"
brew "openblas"
brew "opencv" # computer vision library
brew "openjdk" # Java Development Kit
brew "openssl@3"
brew "openvino"
brew "bun" # JavaScript runtime
brew "parallel" # GNU Parallel
brew "pcre" # Perl-compatible regular expressions library
brew "perl"
brew "perltidy" # Perl code formatter
brew "php"
brew "pinentry-mac" # pinentry for GPG
brew "pnpm" # Node.js package manager
brew "podman" # daemonless container engine
brew "procs" # process viewer
brew "pwgen" # password generator
brew "python-tk@3.14"
brew "python@3.13"
brew "python@3.14"
brew "qt5compat"
brew "qtgraphs"
brew "qtgrpc"
brew "qthttpserver"
brew "qtimageformats"
brew "qtlanguageserver"
brew "qtlocation"
brew "qtlottie"
brew "r"
brew "redis"
brew "rmtrash" # safer rm command
brew "ruby"
brew "ruff" # Python linter
brew "rumdl"
brew "samtools" # bioinformatics tool
brew "sevenzip" # 7zip command line tool
brew "telnet"
brew "tmux" # terminal multiplexer
brew "tpm" # tmux plugin manager
brew "trzsz" # file transfer tool for terminal
brew "tuios"
brew "mole"
brew "ugit"
brew "universal-ctags"
brew "uv"
brew "vim"
brew "virtualenv"
brew "wget"
brew "xh" # friendly curl replacement
brew "xz" # compression tool
brew "yt-dlp"
brew "zellij" # terminal workspace manager
brew "zoxide" # smarter cd command
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zstd" # compression tool
cask "affinity" # photo editor
cask "chatwise" # AI chat client
cask "coconutbattery" # battery health monitor
cask "docker-desktop"
cask "flox"
cask "folo"
cask "font-cascadia-mono"
cask "font-reddit-mono"
cask "ghostty" # terminal app for writers
cask "iina" # modern video player
cask "keyboardcleantool"
cask "keycastr" # show keystrokes on screen
cask "maccy" # clipboard manager
cask "macdroid" # mount android devices
cask "macfuse"
cask "macs-fan-control" # control mac fan speeds
cask "marta" #` file manager with terminal integration
cask "orbstack" # lightweight container manager
cask "pearcleaner"
cask "podman-desktop" # GUI for podman
cask "surge"
cask "syntax-highlight" # macOS quicklook plugin
cask "warp" # modern terminal
cask "zed"  # modern text editor
